##  Pandas Tutorial

In [2]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame(np.random.rand(1,20).reshape(5,4), index=['Row1', 'Row2','Row3','Row4','Row5'],columns=['Column1','Column2','Column3','Column4'])

In [7]:
df.head()

       Column1   Column2   Column3   Column4
Row1  0.436971  0.411715  0.284654  0.537464
Row2  0.634439  0.942940  0.118442  0.940597
Row3  0.986679  0.271494  0.527125  0.609448
Row4  0.075103  0.847567  0.378689  0.540891
Row5  0.020909  0.745713  0.124095  0.526080

In [8]:
df.to_csv('Testing.csv')

#### Accessing elements
- There are 2 methods to access
- 1. .loc []
- 2. .iloc [index location you give both rows and columns index]

In [9]:
df.loc['Row1']

Column1    0.436971
Column2    0.411715
Column3    0.284654
Column4    0.537464
Name: Row1, dtype: float64

In [10]:
type(df.loc['Row1'])

pandas.core.series.Series

In [14]:
df.iloc[:]

       Column1   Column2   Column3   Column4
Row1  0.436971  0.411715  0.284654  0.537464
Row2  0.634439  0.942940  0.118442  0.940597
Row3  0.986679  0.271494  0.527125  0.609448
Row4  0.075103  0.847567  0.378689  0.540891
Row5  0.020909  0.745713  0.124095  0.526080

In [32]:
df.iloc[:,:]

       Column1   Column2   Column3   Column4
Row1  0.436971  0.411715  0.284654  0.537464
Row2  0.634439  0.942940  0.118442  0.940597
Row3  0.986679  0.271494  0.527125  0.609448
Row4  0.075103  0.847567  0.378689  0.540891
Row5  0.020909  0.745713  0.124095  0.526080

In [37]:
# Converting Dataframes into Arrays
df.iloc[:].values

array([[0.4369714 , 0.41171524, 0.28465363, 0.53746369],
       [0.63443853, 0.94294009, 0.11844224, 0.94059697],
       [0.98667861, 0.27149392, 0.52712475, 0.60944761],
       [0.07510276, 0.8475669 , 0.37868874, 0.5408912 ],
       [0.02090923, 0.74571333, 0.12409491, 0.52607992]])

In [38]:
df.iloc[:,:].values.shape

(5, 4)

In [39]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [42]:
# To check how many times a particular value is repeated in a particular Column
df['Column1'].value_counts()

0.986679    1
0.075103    1
0.634439    1
0.436971    1
0.020909    1
Name: Column1, dtype: int64

In [44]:
# To check unique values in the column 
df['Column1'].unique()

array([0.4369714 , 0.63443853, 0.98667861, 0.07510276, 0.02090923])

In [48]:
df[['Column1','Column3']]

       Column1   Column3
Row1  0.436971  0.284654
Row2  0.634439  0.118442
Row3  0.986679  0.527125
Row4  0.075103  0.378689
Row5  0.020909  0.124095

In [49]:
df2 = pd.read_csv('covid-variants.csv')

In [50]:
df2

,location,date,variant,num_sequences,perc_sequences,num_sequences_total
0,Angola,2020-07-06,Alpha,0,0.0,3
1,Angola,2020-07-06,B.1.1.277,0,0.0,3
2,Angola,2020-07-06,B.1.1.302,0,0.0,3
3,Angola,2020-07-06,B.1.1.519,0,0.0,3
4,Angola,2020-07-06,B.1.160,0,0.0,3
...,...,...,...,...,...,...
100411,Zimbabwe,2021-11-01,Omicron,0,0.0,6
100412,Zimbabwe,2021-11-01,S:677H.Robin1,0,0.0,6
100413,Zimbabwe,2021-11-01,S:677P.Pelican,0,0.0,6
100414,Zimbabwe,2021-11-01,others,0,0.0,6
100415,Zimbabwe,2021-11-01,non_who,0,0.0,6

In [53]:
df2['variant'].value_counts()

Epsilon           4184
B.1.160           4184
B.1.221           4184
Eta               4184
Alpha             4184
Delta             4184
S:677H.Robin1     4184
B.1.1.519         4184
non_who           4184
B.1.620           4184
others            4184
B.1.367           4184
Beta              4184
Kappa             4184
Mu                4184
B.1.1.277         4184
Lambda            4184
S:677P.Pelican    4184
Iota              4184
Omicron           4184
B.1.258           4184
B.1.1.302         4184
B.1.177           4184
Gamma             4184
Name: variant, dtype: int64

In [56]:
df2['date'].value_counts()

2021-01-25    2688
2021-02-08    2688
2021-04-19    2640
2021-05-03    2640
2021-07-12    2640
2021-03-08    2640
2021-07-26    2640
2021-01-04    2616
2021-02-22    2616
2021-05-31    2592
2021-08-09    2592
2021-06-14    2568
2021-06-28    2568
2021-05-17    2544
2021-04-05    2520
2021-03-22    2520
2021-09-06    2472
2021-08-23    2424
2020-12-21    2424
2021-01-11    2376
2021-09-20    2304
2020-11-23    2280
2021-11-01    2280
2021-10-04    2256
2020-12-07    2232
2021-10-18    2184
2020-10-12    2184
2021-11-15    2136
2020-11-09    2088
2020-08-17    2088
2020-08-31    2064
2021-12-13    2064
2020-10-26    2064
2021-11-29    2040
2020-09-28    2016
2020-09-14    2016
2020-06-22    1896
2020-07-20    1896
2020-06-08    1872
2020-05-11    1872
2020-08-03    1848
2020-07-06    1776
2020-05-25    1728
2021-12-27    1536
2022-01-05     288
Name: date, dtype: int64

In [57]:
df2.isnull().sum()

location               0
date                   0
variant                0
num_sequences          0
perc_sequences         0
num_sequences_total    0
dtype: int64

In [61]:
df2.isna().sum()

location               0
date                   0
variant                0
num_sequences          0
perc_sequences         0
num_sequences_total    0
dtype: int64

In [62]:
df2.head()

,location,date,variant,num_sequences,perc_sequences,num_sequences_total
0,Angola,2020-07-06,Alpha,0,0.0,3
1,Angola,2020-07-06,B.1.1.277,0,0.0,3
2,Angola,2020-07-06,B.1.1.302,0,0.0,3
3,Angola,2020-07-06,B.1.1.519,0,0.0,3
4,Angola,2020-07-06,B.1.160,0,0.0,3

In [63]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100416 entries, 0 to 100415
Data columns (total 6 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   location             100416 non-null  object
 1   date                 100416 non-null  object
 2   variant              100416 non-null  object
 3   num_sequences        100416 non-null  int64
 4   perc_sequences       100416 non-null  float64
 5   num_sequences_total  100416 non-null  int64
dtypes: float64(1), int64(2), object(3)
memory usage: 4.6+ MB

In [64]:
df2.describe()

       num_sequences  perc_sequences  num_sequences_total
count  100416.000000   100416.000000        100416.000000
mean       72.171676        6.154355          1509.582457
std      1669.262169       21.898989          8445.291772
min         0.000000       -0.010000             1.000000
25%         0.000000        0.000000            12.000000
50%         0.000000        0.000000            59.000000
75%         0.000000        0.000000           394.000000
max    142280.000000      100.000000        146170.000000

In [68]:
df2[df2['num_sequences_total']>5]

,location,date,variant,num_sequences,perc_sequences,num_sequences_total
48,Angola,2020-09-28,Alpha,0,0.0,10
49,Angola,2020-09-28,B.1.1.277,0,0.0,10
50,Angola,2020-09-28,B.1.1.302,0,0.0,10
51,Angola,2020-09-28,B.1.1.519,0,0.0,10
52,Angola,2020-09-28,B.1.160,0,0.0,10
...,...,...,...,...,...,...
100411,Zimbabwe,2021-11-01,Omicron,0,0.0,6
100412,Zimbabwe,2021-11-01,S:677H.Robin1,0,0.0,6
100413,Zimbabwe,2021-11-01,S:677P.Pelican,0,0.0,6
100414,Zimbabwe,2021-11-01,others,0,0.0,6
100415,Zimbabwe,2021-11-01,non_who,0,0.0,6

## CSV

In [69]:
from io import StringIO, BytesIO

In [82]:
data = ('col1| col2| col3\n'
       'x|y|1\n'
       'a|b|2 \n'
       'c|d|3')

In [83]:
type(data)

str

In [87]:
pd.read_csv(StringIO(data), sep='|')

  col1  col2   col3
0    x     y      1
1    a     b      2
2    c     d      3

In [96]:
#to read from specific columns
test = pd.read_csv(StringIO(data), sep='|',usecols=['col1'])#,'col2'])

In [97]:
test

  col1
0    x
1    a
2    c

In [109]:
data = ('col1, col2, col3\n'
       '3,5,1\n'
       '44,7,2 \n'
       '9,8,3')

In [116]:
# mentioning the datatype as object
df = pd.read_csv(StringIO(data),sep = ',',dtype=object)
df

  col1  col2  col3
0    3     5     1
1   44     7    2
2    9     8     3

In [117]:
df['col1'][1]

'44'

In [118]:
df = pd.read_csv(StringIO(data),sep = ',',dtype=int)
df

   col1   col2   col3
0     3      5      1
1    44      7      2
2     9      8      3

In [122]:
df['col1'][1]

44

In [126]:
df = pd.read_csv(StringIO(data),sep = ',',dtype={'col1':float})#,'col2':float,'col3':float})
df

   col1   col2   col3
0   3.0      5      1
1  44.0      7      2
2   9.0      8      3

In [132]:
df = pd.read_csv(StringIO(data),dtype={'col1':float})

In [133]:
df

   col1   col2   col3
0   3.0      5      1
1  44.0      7      2
2   9.0      8      3

In [134]:
df.dtypes

col1     float64
 col2      int64
 col3      int64
dtype: object

In [158]:
data = ('index,a,b,c,\n'
       '5,Apple,fruit,4.5,\n'
       '7,Banana,fruit,8,\n'
       '8,Pumpkin,vegetable,6')

In [161]:
df = pd.read_csv(StringIO(data),index_col=0)
df

             a          b    c  Unnamed: 4
index
5        Apple      fruit  4.5         NaN
7       Banana      fruit  8.0         NaN
8      Pumpkin  vegetable  6.0         NaN

In [162]:
df=df.drop(['Unnamed: 4'], axis = 1)
df

             a          b    c
index
5        Apple      fruit  4.5
7       Banana      fruit  8.0
8      Pumpkin  vegetable  6.0

In [163]:
## Quoting and Escape Characters. Very Useful in NLP
data = 'a,b\n"hello, \\"Bob\\", nice to see you",4'

In [166]:
df = pd.read_csv(StringIO(data), escapechar='\\')
df

                               a  b
0  hello, "Bob", nice to see you  4

In [178]:
# URL to csv

df = pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item', sep = '\t')

In [179]:
df

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359
...,...,...,...,...,...
395,SSEA011,College textbooks,3,T,314
396,SSEE041,Smartphones,4,T,335
397,SSFV031A,Food at elementary and secondary schools,3,T,122
398,SSGE013,Infants' equipment,3,T,356
399,SSHJ031,Infants' furniture,3,T,165